app/views/posts/index.html.erb

        <em>Last updated: <%= post.updated_at.strftime("%B %d, %Y %I:%M %p") %></em> <br>
        <%= link_to "Comments (#{post.comments.count})", post_path(post) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (?, ?)  [["post_id", 2], ["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]