app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["content", "Trumps"], ["user_id", 3], ["post_id", 3], ["created_at", "2024-11-02 22:44:19.853333"], ["updated_at", "2024-11-02 22:44:19.853333"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def create
      # create comment
      @post = Post.find(params[:post_id])
      @comment = @post.comments.build(comment_params.merge(user: current_user))
      if @comment.valid? # check validation constraints
        @comment.save
        redirect_to post_path(@post)
      else
        @comments = @post.comments.includes(:user)