app/controllers/posts_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (?, ?)  [["post_id", 2], ["post_id", 1]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 3], ["id", 1]]
---
    def index
      @posts = Post.includes(:user, :comments).order(created_at: :desc)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 3], ["id", 5]]
---
    def show
      # Display post and associated comments
      @comments = @post.comments.includes(:user)

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["content", "hi"], ["user_id", 1], ["created_at", "2024-11-01 20:40:58.487030"], ["updated_at", "2024-11-01 20:40:58.487030"]]
---
    def create
      # create post
      @post = current_user.posts.build(post_params)
      if @post.save

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "new post editing v2 Harrison"], ["updated_at", "2024-11-02 01:02:56.266644"], ["id", 6]]
---
    def update
      # update post if current user created the post
      if @post.update(post_params) && @post.user == current_user

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 11]]
---
    def destroy
      # delete post if current user created the post
      @post.destroy if @post.user == current_user