app/controllers/sessions_controller.rb

      def create
        # Find or create user by username
        user = User.find_or_create_by(username: params[:username])
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["username", "komura"], ["created_at", "2024-11-01 20:40:48.849756"], ["updated_at", "2024-11-01 20:40:48.849756"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "komura"], ["LIMIT", 1]]