app/views/layouts/application.html.erb

        <% if session[:user_id] %>
          <p>Welcome, <strong><%= User.find(session[:user_id]).username %></strong>!</p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]